
-- Шифр - кафедра, специальность, сотрудник
-- Номер - специальность, студент
-- Рег номер - студент, экзамен
-- Таб номер - преподаватель, экзамен
-- Код - дисциплина, экзамен

-- 1. Вывести из таблиц «Кафедра», «Специальность» и «Студент» данные о студентах, 
-- которые обучаются на данном факультете (например, «ит»).

-- SELECT 
--   Ст.Фамилия AS ФамилияСтудента,
--   Ф.Название AS Факультет
-- FROM
--   Факультет Ф,
--   Кафедра К,
--   Специальность Сп,
--   Студент Ст
-- WHERE 
--   Ф.Аббревиатура=К.Факультет
--   AND Сп.Шифр=К.Шифр
--   AND Сп.Номер=Ст.Номер
--   AND Ф.Название='Информационные технологии';

SELECT
	С.Фамилия,
	П.Направление,
	К.Название AS Кафедра, 
	Ф.Название AS Факультет
FROM
	Студент С
		INNER JOIN Специальность П ON С.Номер = П.Номер
		INNER JOIN Кафедра К ON П.Шифр = К.Шифр
		INNER JOIN Факультет Ф ON К.Факультет = Ф.Аббревиатура
WHERE
    Ф.Аббревиатура = 'ит';

-- 2. Вывести из таблиц «Кафедра», «Специальность» и «Сотрудник» данные 
-- о выпускающих кафедрах (факультет, шифр, название, фамилию заведующего).
-- Выпускающей считается та кафедра, на которую есть ссылки в таблице «Специальность».

SELECT DISTINCT
  Ф.Название AS НазваниеФ, 
  К.Шифр,
  К.Название AS НазваниеК,
  С.Фамилия,
  С.Должность
FROM
  Кафедра К
  INNER JOIN Факультет Ф ON Ф.Аббревиатура=К.Факультет
  INNER JOIN Специальность Сп ON Сп.Шифр = К.Шифр
  INNER JOIN Сотрудник С ON С.Шифр = К.Шифр
WHERE С.Должность='зав. кафедрой';

-- 3. Вывести в запросе для каждого сотрудника номер и фамилию его непосредствен-
-- ного руководителя. Для заведующих кафедрами поле руководителя оставить пустым.

SELECT
  С.Фамилия,
  С.Должность,
  IIF(С.Должность!='зав. кафедрой', Ш.Фамилия, '') AS ФамилияШефа
FROM Сотрудник С
  LEFT JOIN Сотрудник Ш ON С.Шеф = Ш.Таб_номер AND С.Таб_номер != С.Шеф;


-- 4. Вывести список студентов, сдавших минимум два экзамена.

SELECT
  С.Рег_номер,
  С.Фамилия,
  COUNT(С.Фамилия) AS Co
  -- Э.Дата
FROM Студент С
  INNER JOIN Экзамен Э ON Э.Рег_номер=С.Рег_номер
GROUP BY  С.Рег_номер, С.Фамилия
HAVING COUNT(С.Фамилия)>=2;

-- SELECT
--   Студент.Фамилия
-- FROM Студент 
-- WHERE EXISTS (SELECT count(Код) FROM Экзамен HAVING count(Код) > 1);

-- 5. Вывести список инженеров с зарплатой, меньшей 20000 руб.

-- SELECT Инженер.Таб_номер, Сотрудник.Фамилия, Сотрудник.Зарплата, Инженер.Специальность
-- FROM Инженер
-- JOIN Сотрудник ON Инженер.Таб_номер = Сотрудник.Таб_номер
-- WHERE Сотрудник.Зарплата < 20000;

-- SELECT Фамилия
-- FROM Сотрудник
-- WHERE Зарплата < 20000 AND Должность='Инженер'; 

-- SELECT 
--   Фамилия,
--   Зарплата
-- FROM Инженер И
-- JOIN Сотрудник С ON И.Таб_номер = С.Таб_номер
-- WHERE Зарплата < 20000;


-- 6. Вывести список студентов, сдавших экзамены в заданной аудитории.

SELECT DISTINCT
  С.Фамилия,
  Э.Аудитория
FROM Студент С
  INNER JOIN Экзамен Э ON Э.Рег_номер=С.Рег_номер
WHERE Э.Аудитория = 'т505';

-- 7. Вывести из таблиц «Студент» и «Экзамен» учетные номера и фамилии студентов, 
-- а также количество сданных экзаменов и средний балл для каждого студента только для тех 
-- студентов, у которых средний балл не меньше заданного (например, 4). 

SELECT
  С.Рег_номер,
  С.Фамилия,
  COUNT(Э.Оценка) AS КолвоОценок,
  AVG(Э.Оценка) AS СреднийБал
FROM Студент С
  INNER JOIN Экзамен Э ON Э.Рег_номер=С.Рег_номер
GROUP BY С.Рег_номер, С.Фамилия
HAVING AVG(Э.Оценка) >= 4;

-- 8. Вывести список заведующих кафедрами и их зарплаты, и степень.

SELECT
  С.Фамилия, 
  С.Должность, 
  С.Зарплата, 
  П.Звание,
  П.Степень
FROM Сотрудник С
  INNER JOIN Преподаватель П ON П.Таб_номер=С.Таб_номер
WHERE С.Должность='зав. кафедрой';


-- 9. Вывести список профессоров.

SELECT
  С.Фамилия, 
  С.Должность, 
  С.Зарплата, 
  П.Звание,
  П.Степень
FROM Сотрудник С
  INNER JOIN Преподаватель П ON П.Таб_номер=С.Таб_номер
WHERE П.Звание='профессор';

-- 10.  Вывести  название  дисциплины,  фамилию,  должность  и  степень  преподавателя, 
-- дату и место проведения экзаменов в хронологическом порядке в заданном интервале даты.

SELECT
  Д.Название,
  С.Фамилия, 
  С.Должность, 
  П.Звание, --
  П.Степень,
  Э.Дата,
  Э.Аудитория
FROM Сотрудник С
  INNER JOIN Преподаватель П ON П.Таб_номер=С.Таб_номер
  INNER JOIN Экзамен Э ON Э.Таб_номер=П.Таб_номер
  INNER JOIN Дисциплина Д ON Д.Код=Э.Код
WHERE Э.Дата BETWEEN '2015-06-05' AND '2015-06-17'
ORDER BY Э.Дата;


-- 11.  Вывести фамилию преподавателей, принявших более трех экзаменов.

-- SELECT
--   С.Фамилия,
--   COUNT(Э.Код) AS КолвоЭкзаменов
-- FROM Сотрудник С
--   INNER JOIN Преподаватель П ON П.Таб_номер=С.Таб_номер
--   INNER JOIN Экзамен Э ON Э.Таб_номер=П.Таб_номер
-- GROUP BY
--   С.Фамилия
-- HAVING COUNT(Э.Код) > 3;

-- -- 12.  Вывести список студентов, не сдавших ни одного экзамена в указанной дате. 

SELECT
  С.Рег_номер,
  С.Фамилия,
  Э.Дата
FROM Студент С
  LEFT JOIN Экзамен Э ON Э.Рег_номер=С.Рег_номер AND Э.Дата BETWEEN '2015-06-05' AND '2015-06-05'
WHERE 
  Э.Дата IS NULL;





-- 11
-- CREATE TABLE [Экзамен] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Дата] DATE NULL,
--   [Код] INT NULL,
--   [Рег_номер] INT NULL,
--   [Таб_номер] INT NULL,
--   [Аудитория] VARCHAR(4) NULL,
--   [Оценка] TINYINT NULL,
--   CONSTRAINT [PK_Экзамен] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- -- TRUNCATE TABLE [Экзамен];
-- INSERT INTO [Экзамен] ([Дата], [Код], [Рег_номер], [Таб_номер], [Аудитория], [Оценка])
--  VALUES

-- ('20150605', 102, 10101, 102, 'т505', 4),
-- ('20150605', 102, 10102, 102, 'т505', 4),
-- ('20150605', 202, 20101, 202, 'т506', 4),
-- ('20150605', 202, 20102, 202, 'т506', 3),
-- ('20150607', 102, 30101, 105, 'ф419', 3),
-- ('20150607', 102, 30102, 101, 'т506', 4),
-- ('20150607', 102, 80101, 102, 'м425', 5),
-- ('20150609', 205, 80102, 402, 'м424', 4),
-- ('20150609', 209, 20101, 302, 'ф333', 3),
-- ('20150610', 101, 10101, 501, 'т506', 4),
-- ('20150610', 101, 10102, 501, 'т506', 4),
-- ('20150610', 204, 30102, 601, 'ф349', 5),
-- ('20150610', 209, 80101, 301, 'э105', 4),
-- ('20150610', 209, 80102, 301, 'э105', 4),
-- ('20150612', 101, 80101, 502, 'с324', 4),
-- ('20150615', 101, 30101, 503, 'ф417', 4),
-- ('20150615', 101, 50101, 501, 'ф201', 5),
-- ('20150615', 101, 50102, 501, 'ф201', 3),
-- ('20150615', 103, 10101, 403, 'ф414', 4),
-- ('20150617', 102, 10101, 102, 'т505', 5);


-- (10101, '09.03.03', 'Николаева Н. Н.'),
-- (10102, '09.03.03', 'Иванов И. И.'),
-- (10103, '09.03.03', 'Крюков К. К.'),
-- (20101, '09.03.02', 'Андреев А. А.'),
-- (20102, '09.03.02', 'Федоров Ф. Ф.'),
-- (30101, '14.03.02', 'Бондаренко Б. Б.'),
-- (30102, '14.03.02', 'Цветков К. К.'),
-- (30103, '14.03.02', 'Петров П. П.'),
-- (50101, '01.03.04', 'Сергеев С. С.'),
-- (50102, '01.03.04', 'Кудрявцев К. К.'),
-- (80101, '38.03.05', 'Макаров М. М.'),
-- (80102, '38.03.05', 'Яковлев Я. Я.');


-- 10
-- CREATE TABLE [Студент] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Рег_номер] INT NULL,
--   [Номер] VARCHAR(8) NULL,
--   [Фамилия] VARCHAR(20) NULL,
--   CONSTRAINT [PK_Студент] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- TRUNCATE TABLE [Студент];

-- INSERT INTO [Студент] ([Рег_номер], [Номер], [Фамилия])
--  VALUES
-- (10101, '09.03.03', 'Николаева Н. Н.'),
-- (10102, '09.03.03', 'Иванов И. И.'),
-- (10103, '09.03.03', 'Крюков К. К.'),
-- (20101, '09.03.02', 'Андреев А. А.'),
-- (20102, '09.03.02', 'Федоров Ф. Ф.'),
-- (30101, '14.03.02', 'Бондаренко Б. Б.'),
-- (30102, '14.03.02', 'Цветков К. К.'),
-- (30103, '14.03.02', 'Петров П. П.'),
-- (50101, '01.03.04', 'Сергеев С. С.'),
-- (50102, '01.03.04', 'Кудрявцев К. К.'),
-- (80101, '38.03.05', 'Макаров М. М.'),
-- (80102, '38.03.05', 'Яковлев Я. Я.');


-- 9
-- CREATE TABLE [Преподаватель] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Таб_номер] INT NULL,
--   [Звание] VARCHAR(20) NULL,
--   [Степень] VARCHAR(20) NULL,
--   CONSTRAINT [PK_Преподаватель] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- TRUNCATE TABLE [Преподаватель];

-- INSERT INTO [Преподаватель] ([Таб_номер], [Звание], [Степень])
--  VALUES
-- (101, 'профессор', 'д. т.н.'),
-- (102, 'доцент', 'к. ф.-м. н.'),
-- (105, 'доцент', 'к. т.н.'),
-- (201, 'профессор', 'д. ф.-м. н.'),
-- (202, 'доцент', 'к. ф.-м. н.'),
-- (301, 'профессор', 'д. т.н.'),
-- (302, 'доцент', 'к. т.н.'),
-- (401, 'профессор', 'д. т.н.'),
-- (402, 'доцент', 'к. т.н.'),
-- (403, 'ассистент', '–'),
-- (501, 'профессор', 'д. ф.-м. н.'),
-- (502, 'профессор', 'д. ф.-м. н.'),
-- (503, 'доцент', 'к. ф.-м. н.'),
-- (601, 'профессор', 'д. ф.-м. н.');


-- 8
-- CREATE TABLE [Инженер] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Таб_номер] INT NULL,
--   [Специальность] VARCHAR(20) NULL,
--   CONSTRAINT [PK_Инженер] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- TRUNCATE TABLE [Инженер];

-- INSERT INTO [Инженер] ([Таб_номер], [Специальность])
--  VALUES
-- (153 , 'электроник'),
-- (241, 'электроник'),
-- (242, 'программист'),
-- (435, 'электроник'),
-- (614, 'программист');


-- 7
-- CREATE TABLE [Зав_кафедрой] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Таб_номер] INT NULL,
--   [Стаж] INT NULL
--   CONSTRAINT [PK_Зав_кафедрой] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- TRUNCATE TABLE [Зав_кафедрой];

-- INSERT INTO [Зав_кафедрой] ([Таб_номер], [Стаж])
--  VALUES
-- (101, 15),
-- (201, 18),
-- (301, 20),
-- (401, 10),
-- (501, 18),
-- (601, 8);


-- 6
-- CREATE TABLE [Заявка] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Код] INT NULL,
--   [Номер] VARCHAR (8) NULL
--   CONSTRAINT [PK_Заявка] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- TRUNCATE TABLE [Заявка];
-- INSERT INTO [Заявка] ([Код], [Номер])
--  VALUES
-- (101, '01.03.04'),
-- (205, '01.03.04'),
-- (209, '01.03.04'),
-- (101, '09.03.02'),
-- (102, '09.03.02'),
-- (103, '09.03.02'),
-- (202, '09.03.02'),
-- (205, '09.03.02'),
-- (209, '09.03.02'),
-- (101, '09.03.03'),
-- (102, '09.03.03'),
-- (103, '09.03.03'),
-- (202, '09.03.03'),
-- (205, '09.03.03'),
-- (101, '14.03.02'),
-- (102, '14.03.02'),
-- (103, '14.03.02'),
-- (204, '14.03.02'),
-- (101, '38.03.05'),
-- (103, '38.03.05'),
-- (202, '38.03.05'),
-- (209, '38.03.05');


-- 5
-- CREATE TABLE [Дисциплина] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Код] INT NULL,
--   [Объем] INT NULL,
--   [Название] VARCHAR (50) NULL,
--   [Исполнитель] VARCHAR (2) NULL
--   CONSTRAINT [PK_Дисциплина] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- TRUNCATE TABLE [Дисциплина];
-- INSERT INTO [Дисциплина] ([Код], [Объем], [Название], [Исполнитель])
--  VALUES
-- (101, 320, 'Математика', 'вм'),
-- (102, 160, 'Информатика', 'пи'),
-- (103, 160, 'Физика', 'оф'),
-- (202, 120, 'Базы данных', 'ис'),
-- (204, 160, 'Электроника', 'эф'),
-- (205, 80, 'Программирование', 'пи'),
-- (209, 80, 'Моделирование', 'мм');


-- 5
-- CREATE TABLE [Дисциплина] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Код] INT NULL,
--   [Объем] INT NULL,
--   [Название] VARCHAR (50) NULL,
--   [Исполнитель] VARCHAR (2) NULL
--   CONSTRAINT [PK_Дисциплина] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- TRUNCATE TABLE [Дисциплина];
-- INSERT INTO [Дисциплина] ([Код], [Объем], [Название], [Исполнитель])
--  VALUES
-- (101, 320, 'Математика', 'вм'),
-- (102, 160, 'Информатика', 'пи'),
-- (103, 160, 'Физика', 'оф'),
-- (202, 120, 'Базы данных', 'ис'),
-- (204, 160, 'Электроника', 'эф'),
-- (205, 80, 'Программирование', 'пи'),
-- (209, 80, 'Моделирование', 'мм');


-- 4
-- CREATE TABLE [Специальность] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Номер] VARCHAR (8) NULL,
--   [Направление] VARCHAR (50) NULL,
--   [Шифр] VARCHAR (2) NULL,
--   CONSTRAINT [PK_Специальность] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- TRUNCATE TABLE [Специальность];
-- INSERT INTO [Специальность] ([Номер], [Направление], [Шифр])
--  VALUES
-- ('01.03.04', 'Прикладная математика', 'мм'),
-- ('09.03.02', 'Информационные системы и технологии', 'ис'),
-- ('09.03.03', 'Прикладная информатика', 'пи'),
-- ('14.03.02', 'Ядерные физика и технологии', 'эф'),
-- ('38.03.05', 'Бизнес-информатика', 'ис');


-- 3
-- CREATE TABLE [Сотрудник] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Таб_номер] INT,
--   [Шифр] VARCHAR (2) NULL,
--   [Фамилия] VARCHAR (50) NULL,
--   [Должность] VARCHAR (50) NULL,
--   [Зарплата] SMALLMONEY,
--   [Шеф] INT,
--   CONSTRAINT [PK_Сотрудник] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- TRUNCATE TABLE [Сотрудник];

-- INSERT INTO [Сотрудник] ([Таб_номер], [Шифр], [Фамилия], [Должность], [Зарплата], [Шеф])
--  VALUES
-- (101,'пи', 'Прохоров П.П.', 'зав. кафедрой', 35000, 101),
-- (102,'пи', 'Семенов С.С.', 'преподаватель', 25000, 101),
-- (105,'пи', 'Петров П.П.', 'преподаватель', 25000, 101),
-- (153,'пи', 'Сидорова С.С.', 'инженер', 15000, 102),
-- (201,'ис', 'Андреев А.А.', 'зав. кафедрой', 35000, 201),
-- (202,'ис', 'Борисов Б.Б.', 'преподаватель', 25000, 201),
-- (241,'ис', 'Глухов Г.Г.', 'инженер', 20000, 201),
-- (242,'ис', 'Чернов Ч.Ч.', 'инженер', 15000, 202),
-- (301,'мм', 'Басов Б.Б.', 'зав. кафедрой', 35000, 301),
-- (302,'мм', 'Сергеева С.С.', 'преподаватель', 25000, 301),
-- (401,'оф', 'Волков В.В.', 'зав. кафедрой', 35000, 401),
-- (402,'оф', 'Зайцев З.З.', 'преподаватель', 25000, 401),
-- (403,'оф', 'Смирнов С.С.', 'преподаватель', 15000, 401),
-- (435,'оф', 'Лисин Л.Л.', 'инженер', 20000, 402),
-- (501,'вм', 'Кузнецов К.К.', 'зав. кафедрой', 35000, 501),
-- (502,'вм', 'Романцев Р.Р.', 'преподаватель', 25000, 501),
-- (503,'вм', 'Соловьев С.С.', 'преподаватель', 25000, 501),
-- (601,'эф', 'Зверев З.З.', 'зав. кафедрой', 35000, 601),
-- (602,'эф', 'Сорокина С.С.', 'преподаватель', 25000, 601),
-- (614,'эф', 'Григорьев Г.Г.', 'инженер', 20000, 602);


-- 2
-- CREATE TABLE [Кафедра] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Шифр] VARCHAR (2) NULL,
--   [Название] VARCHAR (50) NULL,
--   [Факультет] VARCHAR (2) NULL,
--   CONSTRAINT [PK_Кафедра] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- TRUNCATE TABLE [Кафедра];

-- INSERT INTO [Кафедра] ([Шифр], [Название], [Факультет])
--  VALUES
-- ('вм', 'Высшая математика', 'ен'),
-- ('ис', 'Информационные системы', 'ит'),
-- ('мм', 'Математическое моделирование', 'фм'),
-- ('оф', 'Общая физика', 'ен'),
-- ('пи', 'Прикладная информатика', 'ит'),
-- ('эф', 'Экспериментальная физика', 'фм');


-- 1
-- CREATE TABLE [Факультет] (
--   [Id] INT IDENTITY (1, 1) NOT NULL,
--   [Аббревиатура] VARCHAR (2) NULL,
--   [Название] VARCHAR (50) NULL,
--   CONSTRAINT [PK_Факультет] PRIMARY KEY CLUSTERED ([Id] ASC)
-- );

-- TRUNCATE TABLE [Факультет];

-- INSERT INTO [Факультет] ([Аббревиатура], [Название])
--  VALUES
-- ('Ен', 'Естественные науки'),
-- ('Гн', 'Гуманитарные науки'),
-- ('Ит', 'Информационные технологии'),
-- ('Фм', 'Физико-математический');

